<template>
  <div class="page">
    <header class="header">
      <img src="./images/logo.png" alt="header-logo" />
      <router-link class="header__link" to="/">Главная</router-link>
      <router-link class="header__link" to="/about"
        >Список ресторанов</router-link
      >
    </header>
    <router-view :restaurantList="restaurantList" @deleteRestaurant='deleteRes'/>
  </div>
</template>

<script>
export default {
  data() {
    return {
      restaurantList: [
        {
          id: 1,
          name: "Twins Garden",
          imageSource: "restaurant",
          busyPlaces: 16,
          totalPlaces: 24,
          status: true,
          description:
            "Самым лучшим рестораном в Москве второй год подряд признается проект братьев Ивана и Сергея Березуцких. В ресторане «Twins Garden» воплощена концепция самообеспечения: рыбу, овощи и травы, молоко и молочную продукцию Березуцкие производят на собственной ферме в Калужской области. В «Twins Garden» сделан акцент на русскую кухню. В главном зале можно посмотреть на настоящую русскую печь, в которой повара готовят на березовых дровах, узнать о хозяйстве Близнецов-Садовников и увидеть лабораторию, где Иван и Сергей работают над меню. Своей целью братья называют возрождение русской кухни и мечтают «вывести ее на новый этап эволюции». /n «Twins Garden» также славится самой большой винной картой в России, которая на сегодня включает более 1000 винных марок. Цены в ресторане достаточно лояльны по сравнению с другими топовыми гастрономическими заведениями столицы — средний чек составляет от 1500 до 2000 рублей. Так что смело приходите и пробуйте! Но не забудьте забронировать столик — «Twins Garden» пользуется большой популярностью среди иностранных гостей.",
        },
        {
          id: 2,
          name: "Lucky Izakaya Bar",
          imageSource: "restaurant2",
          busyPlaces: 0,
          totalPlaces: 68,
          status: false,
          description:
            "На втором месте рейтинга расположился ресторан японской кухни «Lucky Izakaya Bar». Этот проект — авторская интерпретация традиционного японского гастрономического бара «на каждый день». Основатели «Lucky Izakaya Bar» — шеф-повар Глен Баллис и совладельцы бургерных BB&Burgers Иван Кукарских и Богдан Панченко. Ресторан находится на углу Калашного переулка и Большой Никитской. Интерьер простой и в то же время цепляющий — деревянная мебель, компактные столы, длинная барная стойка и теплый приглушенный свет создают атмосферу домашнего уюта. Изюминками меню «Lucky Izakaya Bar» гости называют райс-боулы (рис с татаки и сырой рыбой), хрустящую утку и угорь барбекю с рисом. В баре готовят коктейли и предлагают саке и крепкий алкоголь.",
        },
        {
          id: 3,
          name: "White Rabbit",
          imageSource: "restaurant3",
          busyPlaces: 9,
          totalPlaces: 39,
          status: true,
          description:
            "Первую тройку лучших ресторанов Москвы замыкает проект ресторатора Бориса Зарькова. «White Rabbit» славится не только гастрономическими изысками русской кухни и новым подходом к подаче традиционных русских блюд, но и шеф-поваром года по версии «Ресторанной премии GQ-2016» Владимиром Мухиным. Ресторан расположен на 16-ом этаже Смоленского пассажа — оттуда открывается панорамный вид на исторический центр Москвы.",
        },
        {
          id: 4,
          name: "Сахалин",
          imageSource: "restaurant4",
          busyPlaces: 19,
          totalPlaces: 32,
          status: true,
          description:
            "В ресторане «Сахалин» вы попробуете ракушек, крабов, креветок и рыбу, только что привезенных с берегов Дальнего Востока России. Выбрать сможете сами — в центре зала расположен огромный Raw bar c ледником и аквариумом. Основатели проекта — ресторатор Борис Зарьков и бренд-шеф «White Rabbit Family» Владимир Мухин — создали концепцию гастрономического искусства и открыли «Сахалин» — ресторан, в котором «звучит музыка морей и океанов». Впечатления посетителей дополняет шикарный панорамный вид — «Сахалин» расположен на верхних этажах отеля Аzimut Hotel Smolenskaya.",
        },
        {
          id: 5,
          name: "Buro TSUM",
          imageSource: "restaurant5",
          busyPlaces: 6,
          totalPlaces: 22,
          status: true,
          description:
            "Почетное пятое место в рейтинге ресторанов с самой вкусной кухней занимает панорамный ресторан «Buro TSUM» с гастрономическим меню и лионским грилем. Заведение расположено на 5 этаже ЦУМа, в самом сердце столицы — из зала открывается панорамный вид на Большой театр, Петровку и Неглинную улицу. «Buro TSUM» — совместный проект двух рестораторов, Дины Хабировой и Виталия Шиманского. Рестораном заправляют два шефа одновременно — Дмитрий Зотов и Владимир Чистяков. Особенностью меню «Buro TSUM» являются разнообразные соусы — так, например, осьминога здесь готовят с копченым перечным соусом, а гребешок подают с соусом шисо.",
        },
        {
          id: 6,
          name: "Белуга",
          imageSource: "restaurant6",
          busyPlaces: 43,
          totalPlaces: 54,
          status: true,
          description:
            "Еще один из топовых ресторанов Москвы — «Белуга», проект Александра Раппортова. Заведение расположено в отеле «Националь»: из зала открывается вид прямо на Красную площадь, Исторический музей и гостиницу «Москва». «Белуга» — ресторан русских деликатесов. Здесь вам предложат два десятка разновидностей икры, архангельского клыкача, карельскую форель и заполярного палтуса. Алкогольные напитки также отличаются большим разнообразием — в «Белуге» вы найдете все доступные в России сорта шампанского, а также одну из самых больших в мире водочных карт. Интерьер ресторана роскошен и весьма экстравагантен — так, например, в центре помещения расположено панно с изображением русских красавиц в кокошниках, которые делают селфи.",
        },
        {
          id: 7,
          name: "Северяне",
          imageSource: "restaurant7",
          busyPlaces: 30,
          totalPlaces: 46,
          status: true,
          description:
            "«Северяне» — русский ресторан, оформленный в скандинавском стиле. В меню представлены европейские закуски в авторском исполнении, северные русские блюда, обширная карта вин, разливного и бутылочного пива. Гости любят фирменные коктейли на основе кордиалов и ликеров. В «Северянах» сделан акцент на русскую кухню. Большинство позиций готовятся на гриле или на печи.",
        },
        {
          id: 8,
          name: "Probka на Цветном",
          imageSource: "restaurant8",
          busyPlaces: 21,
          totalPlaces: 69,
          status: true,
          description:
            "Ресторан Арама Мнацаканова «Probka на Цветном» занимает 8 место в рейтинге лучших ресторанов в центре Москвы. В меню «Probka на Цветном» — многочисленные итальянские пасты и пиццы, а также средиземноморские деликатесы, например, карпаччо, стейк из тунца и тортелли с черным трюфелем. В ресторане можно провести день рождения или организовать банкет — меню обсуждается индивидуально, а его стоимость начинается от 2000 рублей. Средний чек «Probka на Цветном» — 2500 руб. без напитков.",
        },
        {
          id: 9,
          name: "Selfie",
          imageSource: "restaurant9",
          busyPlaces: 54,
          totalPlaces: 66,
          status: true,
          description:
            "На 9 месте — ресторан современной авторской кухни Анатолия Казакова, который занимает 65 позицию в топе лучших ресторанов мира. Изюминкой «Selfie» является «гастрономический театр» — открытая кухня, спроектированная итальянским дизайнером Андреа Виакава, на которой повара готовят прямо перед гостями. В меню ресторана представлены блюда, приготовленные из российских продуктов — курской свинины, мурманского палтуса, брянской телятины, тверской спаржи, крымского трюфеля. В «Selfie» бережно соблюдают традиции, но не отказываются от гастрономических экспериментов.",
        },
        {
          id: 10,
          name: "Горыныч",
          imageSource: "restaurant10",
          busyPlaces: 32,
          totalPlaces: 81,
          status: true,
          description:
            "«Горыныч» — модное гастрономическое заведение, расположенное на Центральном рынке. Авторы проекта — бренд-шеф «White Rabbit» Владимир Мухин, рестораторы Борис Зарьков и Илья Тютенков. Интерьер ресторана «Горыныч» выполнен в русском фольклорном стиле: на открытой кухне установлена большая круглая печь, которая сделана в Италии и похожа на голову дракона. В меню присутствуют блюда, которые готовятся поварами только в печи — это пицца, лепешки, хлеб на закваске, который можно взять с собой. Также гостям нравятся «бутеры» — большие брускетты с щедрой начинкой.",
        },
      ],
    };
  },
  methods: {
    deleteRes(restaurant){
      this.restaurantList = this.restaurantList.filter(r => r.id !== restaurant.id)
    }
  }
};
</script>

<style>
body {
  margin: 0;
}

.page {
  height: 100vh;
  background: rgb(36, 36, 36);
  font-family: "Courier New", Courier, monospace;
  font-weight: 100;
}

.header {
  display: flex;
  justify-content: space-between;
  background: rgb(14, 14, 14);
  height: 40px;
  padding: 10px;
}

.header__link {
  align-self: center;
  text-decoration: none;
  color: white;
  font-size: 20px;
}

.header__link:hover {
  color: rgb(219, 53, 53);
}

.router-link-active {
  color: rgb(219, 53, 53);
}
</style>